#### Terragrunt Plan 📖 `success`

<details><summary>Show Plan</summary>

```
10:30:02.773 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
10:30:02.773 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
10:30:02.773 STDOUT tofu:   + create
10:30:02.773 STDOUT tofu: OpenTofu will perform the following actions:
10:30:02.773 STDOUT tofu:   # google_storage_bucket.auto-expire will be created
10:30:02.773 STDOUT tofu:   + resource "google_storage_bucket" "auto-expire" {
10:30:02.773 STDOUT tofu:       + effective_labels            = {
10:30:02.774 STDOUT tofu:           + "goog-terraform-provisioned" = "true"
10:30:02.774 STDOUT tofu:         }
10:30:02.774 STDOUT tofu:       + force_destroy               = true
10:30:02.774 STDOUT tofu:       + id                          = (known after apply)
10:30:02.774 STDOUT tofu:       + location                    = "US"
10:30:02.774 STDOUT tofu:       + name                        = "thr-no-public-access-bucket"
10:30:02.774 STDOUT tofu:       + project                     = "psyched-circuit-405312"
10:30:02.774 STDOUT tofu:       + project_number              = (known after apply)
10:30:02.774 STDOUT tofu:       + public_access_prevention    = "enforced"
10:30:02.774 STDOUT tofu:       + rpo                         = (known after apply)
10:30:02.774 STDOUT tofu:       + self_link                   = (known after apply)
10:30:02.774 STDOUT tofu:       + storage_class               = "STANDARD"
10:30:02.774 STDOUT tofu:       + terraform_labels            = {
10:30:02.774 STDOUT tofu:           + "goog-terraform-provisioned" = "true"
10:30:02.774 STDOUT tofu:         }
10:30:02.774 STDOUT tofu:       + time_created                = (known after apply)
10:30:02.775 STDOUT tofu:       + uniform_bucket_level_access = (known after apply)
10:30:02.775 STDOUT tofu:       + updated                     = (known after apply)
10:30:02.775 STDOUT tofu:       + url                         = (known after apply)
10:30:02.775 STDOUT tofu:       + soft_delete_policy (known after apply)
10:30:02.775 STDOUT tofu:       + versioning (known after apply)
10:30:02.775 STDOUT tofu:       + website (known after apply)
10:30:02.775 STDOUT tofu:     }
10:30:02.775 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
10:30:02.775 STDOUT tofu: ─────────────────────────────────────────────────────────────────────────────
10:30:02.775 STDOUT tofu: Note: You didn't use the -out option to save this plan, so OpenTofu can't
10:30:02.775 STDOUT tofu: guarantee to take exactly these actions if you run "tofu apply" now.
```

</details>

*Pusher: @muralisathenapally, Directory: `infra/demo/path2`*